app/views/workouts/show.html.erb

SELECT "exercises".* FROM "exercises" WHERE "exercises"."workout_id" = ?  [["workout_id", 1]]
---
<ul class="questions">
<% @workout.exercises.each do |exercise| %>

SELECT "lifts".* FROM "lifts" WHERE "lifts"."exercise_id" = ?  [["exercise_id", 8]]
---
    <ul class="lifts">
      <% exercise.lifts.each do |lift| %>