app/controllers/exercises_controller.rb

  def index
    @exercises = Exercise.all
---
SELECT "exercises".* FROM "exercises"

  def create
    @exercise = Exercise.new(exercise_params)

    respond_to do |format|
      if @exercise.save
---
INSERT INTO "exercises" ("created_at", "minutes", "name", "rep", "set", "updated_at", "weight") VALUES (?, ?, ?, ?, ?, ?, ?)  [["created_at", Thu, 30 May 2013 02:21:44 UTC +00:00], ["minutes", 20], ["name", "Test"], ["rep", 10], ["set", 3], ["updated_at", Thu, 30 May 2013 02:21:44 UTC +00:00], ["weight", 100]]

    def set_exercise
      @exercise = Exercise.find(params[:id])
---
SELECT "exercises".* FROM "exercises" WHERE "exercises"."id" = ? LIMIT 1  [["id", "1"]]