app/controllers/lifts_controller.rb

SELECT "lifts".* FROM "lifts"
---
  def index
    @lifts = Lift.all

INSERT INTO "lifts" ("created_at", "reps", "updated_at", "weight") VALUES (?, ?, ?, ?)  [["created_at", Sun, 09 Jun 2013 21:17:42 UTC +00:00], ["reps", 10], ["updated_at", Sun, 09 Jun 2013 21:17:42 UTC +00:00], ["weight", 130]]
---
  def create
    @lift = Lift.new(lift_params)

    respond_to do |format|
      if @lift.save

SELECT "lifts".* FROM "lifts" WHERE "lifts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_lift
      @lift = Lift.find(params[:id])