app/controllers/workouts_controller.rb

SELECT "workouts".* FROM "workouts"
---
  def index
    @workouts = Workout.all

INSERT INTO "workouts" ("created_at", "name", "updated_at") VALUES (?, ?, ?)  [["created_at", Fri, 07 Jun 2013 02:22:52 UTC +00:00], ["name", "Upper"], ["updated_at", Fri, 07 Jun 2013 02:22:52 UTC +00:00]]
---
  def create
    @workout = Workout.new(workout_params)

    respond_to do |format|
      if @workout.save

UPDATE "workouts" SET "name" = ?, "updated_at" = ? WHERE "workouts"."id" = 6  [["name", "Legs"], ["updated_at", Sun, 09 Jun 2013 20:07:07 UTC +00:00]]
---
  def update
    respond_to do |format|
      if @workout.update(workout_params)

DELETE FROM "workouts" WHERE "workouts"."id" = ?  [["id", 1]]
---
  def destroy
    @workout.destroy

SELECT "workouts".* FROM "workouts" WHERE "workouts"."id" = ? LIMIT 1  [["id", "1"]]
---
    def set_workout
      @workout = Workout.find(params[:id])